{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Valentina Schüller",
	"language": "en",
	"home_page_url": "https://valentinaschueller.github.io/",
	"feed_url": "https://valentinaschueller.github.io/feed/feed.json",
	"description": "PhD Student in Numerical Analysis at Lund University.",
	"author": {
		"name": "",
		"url": ""
	},
	"items": [
		{
			"id": "https://valentinaschueller.github.io/blog/2024/interdisziplinare-wochen/",
			"url": "https://valentinaschueller.github.io/blog/2024/interdisziplinare-wochen/",
			"title": "Interdisziplinäre Wochen",
			"content_html": "<p>Nach einem Gastvortrag von <a href=\"https://www.maths.cam.ac.uk/person/rdc26\">Rachel Camina</a> über die <a href=\"https://en.wikipedia.org/wiki/Nottingham_group\">Nottingham-Gruppe</a> letzte Woche hatte ich ein sehr nettes Gespräch mit ein paar &quot;meiner&quot; Student:innen aus dem Mathe-Bachelorstudiengang hier in Lund. Wie das so ist, wurde ich gefragt, aus den Ingenieurwissenschaften an eine Mathematikfakultät zu wechseln. Eine sehr gute Art, ein stabiles Hochstapler-Syndrom zu entwickeln! Es ist ja schon verrückt, Leute zu unterrichten, die in einem (an Bachelorstudierende gerichteten) Vortrag über Gruppentheorie besser mitkommen als ich.</p>\n<p>Immer ein bisschen zu theoretisch für die einen oder zu angewandt für die anderen, das zieht sich als Motiv durch die ersten 16 Monate Promotion (und ja, es sind schon 16 Monate!). Der Fluch der Interdisziplinarität! Das Schöne ist wiederum, dass ich mit den verschiedensten Leuten und Themen zu tun habe; nicht nur bei Vorträgen in reiner Mathematik bei uns an der Fakultät, sondern auch in diversen Räumen außerhalb des Mathematikzentrums.</p>\n<p>Am Dienstag zum Beispiel war ich bei der <a href=\"https://www.agenda2030graduateschool.lu.se/activities/phd-conference-sustainable-development-24-september-2024\">vierten PhD-Konferenz für Nachhaltige Entwicklung</a>, einer LU-weite Konferenz für alle Doktorand:innen, die sich in ihrer Arbeit irgendwie mit den <a href=\"https://de.wikipedia.org/wiki/Ziele_f%C3%BCr_nachhaltige_Entwicklung\">17 Zielen für nachhaltige Entwicklung</a> beschäftigen. Ich war hier schon letztes Jahr und finde das ein wirklich cooles Forum, um ein Gefühl dafür zu bekommen, wie weit auseinander die Forschung an dieser Uni geht. Und dass wir doch alle beim gleichen Arbeitgeber sind und miteinander reden können (sollten!). Hier ein paar Gedanken, die ich hieraus mitgenommen habe:</p>\n<ul>\n<li>Wenn sich Menschen zusammenschließen, kann man unterscheiden zwischen der Abstimmung gemeinsamer Handlungen und der Einigung auf eine gemeinsame Erzählung (coordination of effort vs. coordination of narrative): <a href=\"https://portal.research.lu.se/en/persons/lena-halldenius\">Lena Halledenius</a> schlägt vor, die Agenda 2030–Ziele mehr als Beispiel für eine koordinierte Erzählung zu begreifen.</li>\n<li>Wir können ebenso unterscheiden in horizontale und vertikale Kommunikation in unserer Gesellschaft. Horizontal heißt, den Austausch mit Freund:innen, Kolleg:innen, &quot;Gleichgestellten&quot; zu suchen. Vertikale Beispiele: Informationskampagnen &quot;von oben&quot;, Demonstrationen &quot;gegen die da oben&quot;. <a href=\"https://portal.research.lu.se/en/persons/markku-rummukainen\">Markku Rummukainen</a> meinte &quot;one thing I know is that <em>horizontal influence is effective</em>&quot;. Auch wenn sich das weniger &quot;skalierbar&quot; anfühlt, glaube ich, dass wir mehr hiervon brauchen. Letztendlich ist es denke ich ein Hybrid, der funktioniert: Identifizieren, wer in der Lage ist, etwas zu verändern, und diesen Personen auf Augenhöhe zu begegnen, das Gespräch mit ihnen suchen. In jeder Firma, jeder Behörde, jedem Verein, jedem Parlament, sitzen Menschen.<sup class=\"footnote-ref\"><a href=\"https://valentinaschueller.github.io/blog/2024/interdisziplinare-wochen/\" id=\"fnref1\">[1]</a></sup></li>\n<li>Die Paper-Präsentationen am Vormittag haben mich über Interessenskonflikte in der Wissenschaft nachdenken lassen. Mittlerweile sind &quot;Conflict of Interest&quot;-Erklärungen in Artikeln ja (sogar in der angewandten Mathematik!) recht gang und gäbe. Aber schreiben wir da rein, welche Interessenskonflikte wir <em>wirklich</em> haben? &quot;The first author would like to acknowledge that this paper feels a bit half-baked. While they deeply care about producing valuable and thorough research, their PhD program requires four journal publications for graduation...&quot;. Ich arbeite noch an der Idee! Aber sehe Potenzial für einen zukünftigen, halb ernst gemeinten, Blogpost &quot;Honest Conflict of Interest–Declarations&quot;.</li>\n<li>Ein stabiler Satz aus der Präsentation von <a href=\"https://portal.research.lu.se/en/persons/florencia-radeljak\">Florencia Radeljak</a> über eine <a href=\"https://ekhilur.eus/\">alternative Währung im Baskenland</a>: &quot;The prevailing form of money pretends to be universal but manifests as modern and colonial.&quot;</li>\n</ul>\n<p>Und dann war ich von Mittwoch bis Freitag in Helsingborg, gemeinsam mit meiner Graduate School <a href=\"https://www.cec.lu.se/climbeco\">ClimBEco</a>. Wir hatten &quot;Sommer&quot;-Tagung, es ging um nachhaltige Stadtentwicklung und Biodiversität. Unter anderem sind wir in strömendem Regen mehrere Stunden mit ein paar Ökolog:innen und Landschaftsarchitekt:innen der Kommune durch die Stadt gelaufen. Das war so cool! Die Lokalpolitikerin in mir ist aufgeblüht. Zuallererst einmal deswegen, weil diese Menschen in der Verwaltung sich ernsthaft Gedanken machen darüber, wie sie Helsingborg nachhaltiger und sicherer für alle machen können, dabei die Stadtbevölkerung mit einbeziehen und sich der Komplexität des Unterfangens so bewusst sind (die Gefahr von Gentrifizierung mit eingeschlossen!). Highlights hieraus:</p>\n<ul>\n<li>Auf dem Stadtgebiet Helsingborgs wohnen über 6000 Spezies, davon sind wir eine!</li>\n<li>Die Stadt hat für sich einen Mechanismus entwickelt, um bei Stadtentwicklungsmaßnahmen Naturschutz zu berücksichtigen: Bei jedem Projekt berechnen sie basierend auf Fläche, Auswirkung der Baumaßnahme, und Landschaftsqualität (vor der Maßnahme) ein Budget für Naturschutz. Das ist fix zugeteilt und kann dann von Ökolog:innen sinnvoll eingesetzt werden. Money matters!</li>\n<li><a href=\"https://helsingborg.se/trafik-och-stadsplanering/planering-och-utveckling/tryggare-platser/parklets/\">Auch in Helsingborg gibt es Parklets</a>. Die Probleme hiermit sind ähnlich wie in München: Sie sind teuer, es gibt politischen Druck, keine Parkplätze zu opfern und der administrative Overhead ist groß. Aber, coole Idee: Die Kommunen arbeiten mit lokal verankerten Vereinen/Organisationen zusammen, um die Akzeptanz für die Orte zu erhöhen (und sich z.B. ums Gießen zu kümmern). Zum Beispiel wird dann die schwedische Kirche oder die libanesische Gemeinschaft Patenorganisation.<sup class=\"footnote-ref\"><a href=\"https://valentinaschueller.github.io/blog/2024/interdisziplinare-wochen/\" id=\"fnref2\">[2]</a></sup></li>\n<li>&quot;Recycling&quot; innerhalb der Stadtverwaltung: Ein ausrangiertes Parklet wurde an eine der Schulen übergeben und steht dort jetzt auf dem Pausenhof; Die Blumenkörbe, die im Sommer in der Innenstadt hängen, werden im Herbst in anderen Grünflächen weiter außerhalb vergraben, sodass in den Folgejahren noch ein paarmal Blumen daraus wachsen.</li>\n<li>Stichwort Schwammstadt: In Helsingborg gibt es im Stadtgebiet gezielte Flächen, die bei Starkregen Wasser auffangen. Bei unserem Spaziergang haben wir das sehr eindrucksvoll gesehen:</li>\n</ul>\n<p><picture><source type=\"image/avif\" srcset=\"https://valentinaschueller.github.io/img/EbvzvZqmRB-4032.avif 4032w\"><source type=\"image/webp\" srcset=\"https://valentinaschueller.github.io/img/EbvzvZqmRB-4032.webp 4032w\"><img alt=\"Helsingborg voller Wasser, ich voller Gedanken.\" loading=\"lazy\" decoding=\"async\" src=\"https://valentinaschueller.github.io/img/EbvzvZqmRB-4032.jpeg\" width=\"4032\" height=\"3024\"></picture></p>\n<p>Jetzt freue ich mich dann aber auch wieder darauf, mit meiner eigenen Forschung weiterzukommen. Das mit dem Hochstapler-Syndrom wird ja nicht besser, wenn man nicht auch mal zwischendurch <a href=\"https://arxiv.org/abs/2408.12582\">etwas aufschreibt</a>.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Dazu passt auch: <a href=\"https://www.youtube.com/watch?v=76qL1Rtyhiw\">&quot;individual actions that aren't individual actions&quot;</a> von ItsRadishTime. <a href=\"https://valentinaschueller.github.io/blog/2024/interdisziplinare-wochen/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p>Ich habe auch ein neues Wort gelernt: <a href=\"https://placemaking-europe.eu/\">Placemaking</a>! <a href=\"https://valentinaschueller.github.io/blog/2024/interdisziplinare-wochen/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n",
			"date_published": "2024-09-29T00:00:00Z"
		}
		,
		{
			"id": "https://valentinaschueller.github.io/blog/2024/submitting-on.arxiv/",
			"url": "https://valentinaschueller.github.io/blog/2024/submitting-on.arxiv/",
			"title": "Submitting on arXiV in 2024",
			"content_html": "<p>I submitted my first paper<sup class=\"footnote-ref\"><a href=\"https://valentinaschueller.github.io/blog/2024/submitting-on.arxiv/\" id=\"fnref1\">[1]</a></sup> on arXiV yesterday (🎉), alongside submitting it to a journal we want to publish to, and it was way more painful than I thought it would be. I thought I was prepared for everything, I even followed <a href=\"https://trevorcampbell.me/html/arxiv.html\">Trevor Campbell's tutorial</a> which I found less than two weeks ago.</p>\n<p>Alas, it did not go as expected. The reasons were threefold:</p>\n<ol>\n<li>I worked with my local LaTeX files and TeXLive installation,</li>\n<li>I used <code>biblatex</code> for my references,</li>\n<li>my version of TeXLive is newer than the one on arXiV.\nThis way, all my references were missing from the generated PDF. It took me quite a while to figure out what to look for, but then the easiest way for me to solve it was to use a <a href=\"https://tex.stackexchange.com/a/723571\">script from StackExchange</a> that downgrades my version 3.3 <code>.bbl</code> file to version 3.2. That fixed it 🙌</li>\n</ol>\n<p>Right after that, I talked to one of my group members, who simply suggested to use Overleaf for the final step: Using their <a href=\"https://www.overleaf.com/learn/how-to/LaTeX_checklist_for_arXiv_submissions\">submit to arXiV feature</a> should do the trick without all of the pain... I'll try that next time!</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>it's here: <a href=\"https://arxiv.org/abs/2408.12582\">https://arxiv.org/abs/2408.12582</a> <a href=\"https://valentinaschueller.github.io/blog/2024/submitting-on.arxiv/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n",
			"date_published": "2024-08-23T00:00:00Z"
		}
		,
		{
			"id": "https://valentinaschueller.github.io/blog/2024/support-structure/",
			"url": "https://valentinaschueller.github.io/blog/2024/support-structure/",
			"title": "A Tool to Reflect on Supervision — Support-Structure",
			"content_html": "<p>One of the discussion topics in my research ethics course last year was related to the ethics of (PhD) supervision. The group leading this discussion had a cool idea for having us reflect on our own situation. I <em>think</em> it was based on a research paper <sup class=\"footnote-ref\"><a href=\"https://valentinaschueller.github.io/blog/2024/support-structure/\" id=\"fnref1\">[1]</a></sup> but I am not sure. I call it the <strong>support-structure chart</strong>.</p>\n<p>The idea is that two crucial aspects of the supervision process are the amount of support and the level of structure provided by the supervisor. Different people have different expectations and requirements here (and these might change over the course of a PhD/any other type of supervised project). I think making this explicit can be helpful in terms of understanding the student–supervisor dynamic.</p>\n<p>This is what you do: You draw a simple coordinate system, the axes corresponding to the amount of support &amp; structure in the supervision. It looks like this:</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://valentinaschueller.github.io/img/NtQ0TpNphd-1369.avif 1369w\"><source type=\"image/webp\" srcset=\"https://valentinaschueller.github.io/img/NtQ0TpNphd-1369.webp 1369w\"><img alt=\"A sketch of the support-structure chart.\" loading=\"lazy\" decoding=\"async\" src=\"https://valentinaschueller.github.io/img/NtQ0TpNphd-1369.jpeg\" width=\"1369\" height=\"1000\"></picture></p>\n<p>Now add points in this chart corresponding to three questions:</p>\n<ol>\n<li>What does optimal supervision look like for you?</li>\n<li>What do you think would be ideal from the perspective of your supervisor?</li>\n<li>What does the reality of your supervision process look like?</li>\n</ol>\n<p>Bonus points for letting your supervisor answer these questions for themselves and then comparing what you came up with! One can also do this exercise with fellow students (we did it in the classroom in a group of ~15 PhD students).</p>\n<p>I know that both &quot;support&quot; and &quot;structure&quot; are somewhat vague terms here. I think it is interesting to keep it this way and discuss differences in interpretation afterwards. But I might change my mind about this.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>González-Ocampo, G., &amp; Castelló, M. (2018). How do doctoral students experience supervision? <em>Studies in Continuing Education</em>, <em>41</em>(3), 293–307. <a href=\"https://doi-org.ludwig.lub.lu.se/10.1080/0158037X.2018.1520208\">https://doi-org.ludwig.lub.lu.se/10.1080/0158037X.2018.1520208</a> <a href=\"https://valentinaschueller.github.io/blog/2024/support-structure/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n",
			"date_published": "2024-08-17T00:00:00Z"
		}
		,
		{
			"id": "https://valentinaschueller.github.io/blog/2024/drei-memoiren/",
			"url": "https://valentinaschueller.github.io/blog/2024/drei-memoiren/",
			"title": "Drei Frauen, Drei Memoiren",
			"content_html": "<p>Ich habe in den letzten Wochen, mehr durch Zufall, drei Bücher von drei Frauen gelesen, allesamt Memoiren: <em>Die Träume anderer Leute</em> von Judith Holofernes, <em>Pick Me Girls</em> von Sophie Passmann und <em>Spådomen</em><sup class=\"footnote-ref\"><a href=\"https://valentinaschueller.github.io/blog/2024/drei-memoiren/\" id=\"fnref1\">[1]</a></sup> von Agneta Pleijel.</p>\n<p>Memoiren liebe ich: die literarische Verarbeitung des eigenen Lebens. Es passt dazu, dass mir abseits dessen charaktergetriebene Romane &quot;aus dem echten Leben&quot; am meisten gefallen (soll heißen: keine <a href=\"https://en.wikipedia.org/wiki/Genre_fiction\">Genreliteratur</a>). Genauso wie das Interview eines meiner liebsten Journalismusformate ist. Eintauchen in den Kopf anderer Menschen.</p>\n<p>Die drei Bücher also. Die Autorinnen kommen aus drei verschiedenen Generationen — Pleijel: 1940, Holofernes: 1976, Passmann: 1994. Auf eine Art geht es in jedem Buch um sehr vieles, das meiste überlappt sich nicht, so zum Beispiel:</p>\n<ul>\n<li>die gescheiterte Ehe der Eltern<sup class=\"footnote-ref\"><a href=\"https://valentinaschueller.github.io/blog/2024/drei-memoiren/\" id=\"fnref2\">[2]</a></sup> und den seltsamen Mikrokosmos Lund (Pleijel);</li>\n<li>wie Pop in Deutschland produziert wird und ein erfüllendes Künstlerinnendasein nach dem Erfolg (Holofernes);</li>\n<li>unfassbar unangenehme Männer und das Aufwachsen im Internet (Passmann).</li>\n</ul>\n<p>Aber warum Unterschiede aufzählen?</p>\n<p>Die Wörter, die mich beim Nachdenken über alle drei Bücher begleiten, sind <em>Scham</em> und <em>Zufriedenheit</em>: Scham über den eigenen Körper, die eigenen Bedürfnisse, das eigene Leben. Und Zufriedenheit, wenn man sich davon ein Stück weit lösen kann. Sinngemäß schreibt Sophie Passmann: Die zufriedene Frau, die die sich nicht schämt, ist die größte Waffe des Feminismus. Und man fühlt das in den beiden anderen Büchern: Die Hauptfiguren sind am schwächsten, wenn sie sich nicht trauen, ihren Bedürfnissen nachzugehen und sich selbst Raum zu geben (nehmen?). Wenn sie nicht an sich glauben. Andersherum: Je freier sie sich machen von (gefühltem) Druck von außen, desto stärker, spannender, bewundernswerter finde ich sie. Desto freier sind sie, insgesamt.</p>\n<p>Wunderbare Bücher, großartige Frauen.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Die Prophezeiung <a href=\"https://valentinaschueller.github.io/blog/2024/drei-memoiren/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p>Im <a href=\"https://sverigesradio.se/avsnitt/agneta-pleijel-narmar-sig-livets-andra-akt\">P1 Söndagsintervju 05/2023</a>: &quot;Deras äktenskap var en lång lång lång skilsmässoprocedur kan man säga&quot; (27:00) <a href=\"https://valentinaschueller.github.io/blog/2024/drei-memoiren/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n",
			"date_published": "2024-08-03T00:00:00Z"
		}
		,
		{
			"id": "https://valentinaschueller.github.io/blog/2024/scm-coupling/",
			"url": "https://valentinaschueller.github.io/blog/2024/scm-coupling/",
			"title": "Coupling algorithms in the EC-Earth AOSCM",
			"content_html": "<blockquote>\n<p><em>I aim to have one short summary post for each of my active/finished research projects. This is one of them.</em></p>\n</blockquote>\n<p>I started working with the EC-Earth coupled atmosphere–ocean single-column model (AOSCM, <a href=\"https://doi.org/10.5194/gmd-11-4117-2018\">Hartung et al., 2018</a>) during my master's thesis.\nThis is a version of the <a href=\"https://ec-earth.org/\">EC-Earth global climate model</a> which is useful for model development, particularly regarding physics parameterizations in the atmospheric and oceanic boundary layers.\nThe goal here is to make the EC-Earth AOSCM a tool for coupling algorithm development in climate models.</p>\n<p>I have created scripts and workflows to study the impact of different coupling algorithms on model output.\nMy master's thesis covers pure atmosphere-ocean coupling, right now we are working on cases including the sea ice model <a href=\"https://doi.org/10.5281/zenodo.7534900\">SI3</a>.</p>\n<p>See also:</p>\n<ul>\n<li>the corresponding <a href=\"https://github.com/valentinaschueller/ece-scm-coupling\">GitHub repository</a></li>\n<li>my <a href=\"https://valentinaschueller.github.io/research/upload/2024_pasc_poster.pdf\">poster</a> at PASC24</li>\n<li>my <a href=\"https://valentinaschueller.github.io/research/upload/2023_msc-thesis.pdf\">master's thesis</a></li>\n</ul>\n<p><em><strong>Collaborators:</strong> <a href=\"https://www.maths.lu.se/staff/philipp-birken\">Philipp Birken</a>; <a href=\"https://membres-ljk.imag.fr/Florian.Lemarie/\">Florian Lemarié</a> &amp; <a href=\"https://membres-ljk.imag.fr/Eric.Blayo/\">Eric Blayo</a> (<a href=\"https://team.inria.fr/airsea/en/\">AIRSEA Group</a>, INRIA Grenoble); <a href=\"https://www.su.se/english/research/research-groups/dynamic-meteorology\">Dynamic Meteorology Group at MISU</a>.</em></p>\n",
			"date_published": "2024-06-01T00:00:00Z"
		}
		,
		{
			"id": "https://valentinaschueller.github.io/blog/2024/richards-swe-coupling/",
			"url": "https://valentinaschueller.github.io/blog/2024/richards-swe-coupling/",
			"title": "Coupled groundwater-surface flows",
			"content_html": "<blockquote>\n<p><em>I aim to have one short summary post for each of my active/finished research projects. This is one of them.</em></p>\n</blockquote>\n<p>In this project, we analyze coupled surface-subsurface flows for hydrological applications.\nThese are modeled using nonlinear partial differential equations: <a href=\"https://en.wikipedia.org/wiki/Richards_equation\">Richards' equation</a> for groundwater flow and a variant of the <a href=\"https://en.wikipedia.org/wiki/Shallow_water_equations\">shallow water equations</a> for surface flow.\nCoupling them yields a model that can simulate effects of water management and flooding on the water table and aquifer.<sup class=\"footnote-ref\"><a href=\"https://valentinaschueller.github.io/blog/2024/richards-swe-coupling/\" id=\"fnref1\">[1]</a></sup></p>\n<p>Particularly, we have analyzed a linearized, coupled Richards-SWE model using methods developed by <a href=\"https://doi-org.ludwig.lub.lu.se/10.1007/s00466-017-1511-3\">Monge &amp; Birken, 2018</a> and <a href=\"https://doi-org.ludwig.lub.lu.se/10.1007/978-3-319-18827-0_51\">Gander, Kwok &amp; Mandal, 2014</a>.\nWe study how well this analysis works for the fully nonlinear case:\nFor this purpose, I have developed a Python implementation for coupled surface-subsurface flow, using <a href=\"https://dune-project.org/\">DUNE</a> to generate the discretization and <a href=\"https://precice.org/\">preCICE</a> for coupling.</p>\n<p>See also:</p>\n<ul>\n<li>the <a href=\"https://arxiv.org/abs/2408.12582\">preprint on arXiV</a></li>\n<li>the <a href=\"https://gitlab.maths.lu.se/robertk/coupling\">code repository</a></li>\n<li><a href=\"https://valentinaschueller.github.io/research/upload/2024-02-06-pint_slides.pdf\">slides</a> from my talk at PinT 2024</li>\n<li>my <a href=\"https://valentinaschueller.github.io/research/upload/2023_essence_poster.pdf\">poster</a> at the Swedish e-Science conference 2023</li>\n</ul>\n<p><em><strong>Collaborators:</strong> <a href=\"https://www.maths.lu.se/staff/philipp-birken\">Philipp Birken</a> and <a href=\"https://warwick.ac.uk/fac/sci/maths/people/staff/andreas_dedner/\">Andreas Dedner</a>.</em></p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Bastian, P. et al. (<a href=\"https://doi-org.ludwig.lub.lu.se/10.1007/978-3-642-25100-9_65\">2012</a>); Maxwell, R. M. et al. (<a href=\"https://doi.org/10.1002/2013WR013725\">2014</a>) <a href=\"https://valentinaschueller.github.io/blog/2024/richards-swe-coupling/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n",
			"date_published": "2024-03-01T00:00:00Z"
		}
		,
		{
			"id": "https://valentinaschueller.github.io/blog/2023/oscillator-example/",
			"url": "https://valentinaschueller.github.io/blog/2023/oscillator-example/",
			"title": "The oscillator example for coupling algorithms",
			"content_html": "<blockquote>\n<p><em>I aim to have one short summary post for each of my active/finished research projects. This is one of them.</em></p>\n</blockquote>\n<p>During my master's program in Munich, I took a seminar course on fluid-structure interaction.\nMy project, supervised by <a href=\"https://www.cs.cit.tum.de/sccs/personen/benjamin-rodenberg/\">Benjamin Rodenberg</a>, was about the order of convergence in time for coupled systems of equations.\nI demonstrated how the coupling algorithm affects convergence order and energy conservation for a simple example that Benjamin came up with: coupled linear oscillators.</p>\n<p>We published this work as part of the WCCM-APCOM 2022 conference proceedings.</p>\n<p>See also:</p>\n<ul>\n<li>the <a href=\"https://doi.org/10.23967/wccm-apcom.2022.038\">conference paper</a></li>\n<li><a href=\"https://valentinaschueller.github.io/research/upload/2022-09-22-gacm_slides.pdf\">slides</a> from my talk at GACM 2022</li>\n<li>the associated <a href=\"https://precice.org/tutorials-oscillator.html\">preCICE tutorial</a> written by Benjamin Rodenberg</li>\n</ul>\n<p><em><strong>Collaborators:</strong> <a href=\"https://www.cs.cit.tum.de/sccs/personen/benjamin-rodenberg/\">Benjamin Rodenberg</a>; <a href=\"https://www.simtech.uni-stuttgart.de/exc/people/Uekermann/\">Benjamin Uekermann</a>; <a href=\"https://www.professoren.tum.de/bungartz-hans-joachim/\">Hans-Joachim Bungartz</a>.</em></p>\n",
			"date_published": "2023-10-01T00:00:00Z"
		}
		
	]
}
